<template>
    <div class="app bmi-page">
        <mt-header title="鸣鹿健康">
            <!--<a href="/" slot="left">
                <mt-button icon="back">返回</mt-button>
            </a>-->
            <mt-button icon="more" slot="right"></mt-button>
        </mt-header>
        <div class="bmi-container">
            <div class="title">你的BMI指数为<span class="number">{{bmi}}</span><span class="text">（{{perform}}）</span></div>
            <div class="info">(身高：{{height}}，体重：{{weight}}kg)</div>
            <div class="line">
                <div class="line-arrow"><img src="../assets/images/jianfei/bmi-arrow.png" v-bind:style="{'left': left + '%'}"></div>
                <div class="bmi-line"><img src="../assets/images/jianfei/bmi-line.png" alt=""></div>
            </div>
            <div class="description">{{notice}}</div>
        </div>
        <div class="terms"><input type="checkbox" v-model="agree" id="terms"><label for="terms">同意</label><label class="text" @click="popupTerms=true">《鸣鹿减肥法用户协议》</label></div>
        <div class="next-btn">
            <mt-button type="primary" @click="start">开始减肥</mt-button>
        </div>
        <mt-popup class="select-popup" v-model="popupTerms" popup-transition="popup-fade">
            <div class="main">
                <p>用户协议</p>
                <p>1、服务条款的确认和接纳 鸣鹿健康、鸣鹿健康app的所有权、运作权以及其他一切权利归北京鸣鹿健康管理有限公司（以下简称：鸣鹿健康）所有。用户在注册时，接受本协议并点击"确定"按钮完成注册，这表示用户与北京鸣鹿健康管理有限公司达成协议并接受所有的服务条款，具有合同效力。所以，为了保护您的合法权益，请您以最大谨慎态度认真阅读、充分理解本服务协议，如果有任何不清楚之处请联系我们，我们将向您详细说明。
                    再次提醒，请您务必审慎阅读、充分理解各条款内容，特别是以黑体加粗形式提示您注意的条款
                </p>
                <p> 2、服务简介 鸣鹿健康运用自己的服务系统通过网络为用户提供各项服务和产品，原则上相关服务是免费的，但用户必须自行承担其为连接至鸣鹿健康提供的服务器或其他设备而产生的费用；同时，用户也应对选购的相关产品或付费服务承担相应的费用。考虑到鸣鹿健康产品及服务的重要性，用户同意：
                    （1）提供及时、详尽及准确的个人资料。 （2）不断更新注册资料，符合及时、详尽准确的要求。所有原始键入的资料将引用为注册资料。 （3）用户提供的性别、身高、体重、年龄等个人资料及空间记录信息，将用于鸣鹿健康为用户提供的减肥、健康、美丽、检测等方面的服务及相应产品配置。
                    （4）鸣鹿健康保留随时变更、中断或终止部分或全部网络服务的权利。 另外，未经用户授权鸣鹿健康向第三方透露其注册资料，鸣鹿健康不得公开用户的姓名、住址、出件地址、电子邮箱、帐号，但以下情形除外： （1）用户要求鸣鹿健康或授权某人通过电子邮件服务或其他方式透露这些信息。
                    （2）鸣鹿健康可能聘请外部公司或个人代表我们提供某些产品或服务，包括但不限于，提供运营、维护、IT平台和/或技术服务、数据安全或备份服务、处理订单、递送货物、发送信函或电子邮件、清除用户名单中的重复信息、分析数据、提供市场营销帮助、提供搜索结果和链接（包括付费搜索名单和链接）、处理收/付款事项以及提供用户服务。在该等情况下，鸣鹿健康可能会共享用户信息。
                    （3）相应的法律、法规、政府机关要求及程序服务需要鸣鹿健康提供用户的个人资料。 如果用户提供的资料不准确、不真实、不合法有效，鸣鹿健康保留结束用户使用鸣鹿健康各项服务的权利。 用户在享用鸣鹿健康各项服务及购买相应产品的同时，同意接受鸣鹿健康提供的各类信息服务；如果您对鸣鹿健康提供的信息服务不满意，可以选择退订。
                </p>
                <p>3、使用规则 （1）用户在申请使用鸣鹿健康提供的网络服务时，应向鸣鹿健康提供准确的个人资料，如个人资料有任何变动，应及时更新。 （2）用户注册成功后，鸣鹿健康将给予每个用户一个用户帐号及相应的密码，该用户帐号和密码由用户负责保管；用户应当对以其用户帐号进行的所有活动和事件负法律责任。鸣鹿健康建议用户在不长于三个月的周期内修改一次密码，以保证用户帐号的安全性。
                    （3）用户在使用鸣鹿健康络服务过程中，应遵循以下原则： (a) 遵守中国有关的法律和法规； (b) 不得为任何非法目的而使用鸣鹿健康提供的服务； (c) 遵守所有与服务有关的网络协议、规定和程序； (d)
                    不得利用鸣鹿健康提供的服务进行任何可能对互联网的正常运转造成不利影响的行为； (e)不得利用鸣鹿健康提供的服务传输任何骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料； (f)
                    不得利用鸣鹿健康提供的服务进行任何不利于鸣鹿健康的行为； (g)不得利用鸣鹿健康的任何资源做出任何鸣鹿健康未同意的宣传行为、广告行为、促销行为以及其他具有商业性质的行为。
                </p>
                <p>4、服务条款的修改 鸣鹿健康有权不时对本服务服务条款进行修改，服务条款一旦发生变动，鸣鹿健康将公示相关修改内容。如果您不接受修改，请您及时注销您的账号；如果您继续使用鸣鹿健康的服务，则视为您同意鸣鹿健康对服务条款的修改。
                    服务条款一旦发生变动，用户要继续使用鸣鹿健康各项服务需要确认如下两方面内容： （1）确认鸣鹿健康服务条款及其变动。 （2）同意接受所有的服务条款限制。
                </p>
                <p>5、服务修订 鸣鹿健康保留随时修改或中断服务而不需通知用户的权利，原则上鸣鹿健康会通过鸣鹿健康的官方网站统一告知。用户应无条件接受鸣鹿健康行使修改或中断服务的权利，鸣鹿健康不需对用户或第三方负责。
                </p>
                <p>6、用户的帐号、密码和安全性 一旦注册成功成为鸣鹿健康的用户，用户将得到一个密码和帐号，请您妥善保护自己的密码，勿将密码告诉第三人，因密码保管不善而造成的损失由您自行承担；如果用户未保管好自己的帐号和密码而对用户、鸣鹿健康或第三方造成的损害，除非用户能够证明鸣鹿健康存在过错，用户应负承担全部责任。
                    用户应对基于其帐户发生的所有活动和事件负全部责任。用户可随时改变用户帐号、密码和图标，也可以结束旧的帐户重开一个新帐户，不论如何，鸣鹿健康强烈推荐用户定期地修改密码以保证帐户安全性。 用户同意若发现任何非法使用用户帐号或安全漏洞的情况，立即通告鸣鹿健康。
                </p>
                <p>7、拒绝提供担保 用户应自行阅读鸣鹿健康上的信息以及鸣鹿健康的合作伙伴提供的信息，而不论该等信息是否与付费产品、付费服务、免费产品、免费服务有关。用户应在对有关信息充分理解的基础上接受下载或接受鸣鹿健康或鸣鹿健康的合作伙伴提供的产品和/或服务，并由用户自行承担系统受损或资料丢失的所有风险和责任。鸣鹿健康对鸣鹿健康的合作伙伴提供的任何商品、购物过程、服务和/或交易进程都不作任何担保，且鸣鹿健康也不会以任何方式（例如口头或书面）作出为合作伙伴提供担保的意思表示。
                </p>
                <p> 8、有限责任 鸣鹿健康对直接、间接、偶然、特殊损害不负责任，这些损害可能来自：不正当使用产品服务，在网上购买商品或类似服务，在网上进行交易，非法使用服务或用户传送的信息有所变动。这些损害会导致鸣鹿健康形象受损，所以鸣鹿健康不会故意造成这种损害的发生，也会最大程度地防止发生此种损害的可能性。
                </p>
                <p> 9、未经鸣鹿健康同意禁止进行商业性行为 用户承诺，未经鸣鹿健康书面同意，不得利用鸣鹿健康各项服务在鸣鹿健康或相关网站上进行销售或其他商业性行为。用户违反此约定，鸣鹿健康有权删除该用户，并可根据违约行为的严重程度，限制相关用户账号的使用或者注销相关用户账号，并可依法追究其违约责任，由此给鸣鹿健康造成损失的，鸣鹿健康有权进行追偿。
                </p>
                <p> 10、鸣鹿健康信息的储存及限制 鸣鹿健康不对用户所发布信息的删除或储存失败负责，因此如果对于用户非常重要的信息，用户应预先在自己控制的存储设备上保存该等信息。鸣鹿健康保留判定用户的行为是否符合鸣鹿健康虚拟社区服务条款的要求和精神的权利，如果用户违背了服务条款的规定，则中断其虚拟社区服务的帐号。
                </p>
                <p> 11、保障 用户同意保障和维护鸣鹿健康全体成员的利益，用户负责支付由用户使用超出服务范围引起的费用，违反服务条款的损害补偿费用，与其它人使用用户的电脑、帐号和其它知识产权相关的追索费。
                </p>
                <p> 12、结束服务 用户或鸣鹿健康可随时根据实际情况中断服务。鸣鹿健康不需对任何个人或第三方负责而随时中断服务。用户若反对任何服务条款的建议或对后来的条款修改有异议，或对鸣鹿健康服务不满，用户只拥有以下权利： （1）不再使用鸣鹿健康服务。
                    （2）结束用户使用鸣鹿健康服务的资格。 （3）通知鸣鹿健康停止该用户的服务。 结束用户服务后，用户使用鸣鹿健康服务的权利马上终止。从那时起，鸣鹿健康不再对用户承担任何义务。 再次重申，结束用户服务后，鸣鹿健康亦不再对结束用户服务之前的任何事件承担责任。
                </p>
                <p> 13、通告 所有发给用户的通告都可通过电子邮件或常规的信件传送。鸣鹿健康会通过邮件服务发报消息给用户，告诉他们服务条款的修改、服务变更、或其它重要事情。 一旦通过鸣鹿健康一贯使用的技术手段将该等通知发送出去，除非有明确的、可以被证明的信息表明该等通知被退回，否则视为从发出该等通知的24小时内用户已经收到该等通知，且对于紧急通知视为从发出该紧急通知的30分钟内用户已经收到该等通知。如果因为用户更改注册信息或者提供虚假信息或者提供的注册信息未及时更新导致该等通知被退回，则视为用户已经收到该等通知并应由用户承担相应的责任。
                </p>
                <p> 14、参与广告策划 在鸣鹿健康许可下，用户可在他们发表的信息中加入宣传资料或参与广告策划，在鸣鹿健康各项免费服务上展示他们的产品。任何这类促销方法，包括运输货物、付款、服务、商业条件、担保及与广告有关的描述都只是在相应的用户和广告销售商之间发生。鸣鹿健康不承担任何责任，鸣鹿健康没有义务为这类广告销售负任何一部分的责任。
                </p>
                <p> 15、知识产权 用户保证和声明对其所提供的作品拥有完整的合法的著作权和使用权，保证鸣鹿健康使用该作品不违反国家的法律法规，也不侵犯第三方的合法权益或承担任何义务。用户应对其所提供作品因形式、内容及授权的不完善、不合法所造成的一切后果承担完全责任。
                    用户同意鸣鹿健康对其上传作品在全世界范围内享有免费的、永久性的、不可撤消的、独家的和完全的许可使用和再许可的权利。此许可和再许可权利包括但不限于此作品的著作权、邻接权及获得利益等权利。鸣鹿健康保留对其网站所有内容进行实时监控的权利，并有权依其自主判断对任何违反本协议约定的作品实施删除。鸣鹿健康对于删除用户作品引起的任何后果或导致用户的任何损失不负任何责任。
                    用户同意鸣鹿健康可以对用户上传作品或其它知识产权进行整理、汇编，且相关汇编权利归鸣鹿健康所有。若鸣鹿健康需要使用该等汇编作品获其它知识产权的，则鸣鹿健康不须征得用户同意且用户放弃向鸣鹿健康主张权利的权利。
                    因用户作品的违法或侵害第三人的合法权益而导致鸣鹿健康或其关联公司对第三方承担任何性质的赔偿、补偿或罚款而遭受损失（直接的、间接的、偶然的、惩罚性的和继发的损失），用户对于鸣鹿健康或其关联公司蒙受的上述损失承担全面的赔偿责任。
                    一旦鸣鹿健康发现第三方擅自使用用户的知识产权、肖像权或其它权利的，则鸣鹿健康可以在通知用户3个工作日后自行或代表用户开展维权工作，该等维权工作包括但不限于：发函（包括律师函）、诉讼或提出其它要求。用户不得以任何方式阻挠鸣鹿健康的维权工作。如果因为用户的故意行为妨碍鸣鹿健康维权工作的，则用户应承担鸣鹿健康因此发生的维权工作费用，包括但不限于调查取证的费用、差旅费用、律师费用、诉讼费用。
                </p>
                <p> 16、言论 用户承诺发表言论要：爱国、守法、自律、真实、文明。不传输任何非法的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、危害国家安全的、泄露国家机密的、破坏国家宗教政策和民族团结的以及其它违反法律法规及政策的内容。
                    若用户的行为不符合以上提到的服务条款，鸣鹿健康将作出独立判断立即取消用户服务帐号。用户需对自己在网上的行为承担法律责任。 17、内容的所有权 内容的定义包括：文字、软件、声音、相片、录象、图表；在广告中的全部内容；鸣鹿健康服务为用户提供的商业信息。所有这些内容均受版权、商标、标签和其它财产所有权法律的保护。所以，用户只能在鸣鹿健康和广告商授权下才能使用这些内容，而不能擅自复制、再造这些内容、或创造与内容有关的派生产品。
                </p>
                <p> 18、免责与赔偿声明 （1）若鸣鹿健康已经明示其网络服务提供方式发生变更并提醒用户应当注意事项，用户未按要求操作所产生的一切后果由用户自行承担。 （2）用户明确同意其使用鸣鹿健康络服务所存在的风险将完全由其自己承担；因其使用鸣鹿健康服务而产生的一切后果也由其自己承担，鸣鹿健康对用户不承担任何责任。
                    （3）鸣鹿健康不担保网络服务一定能满足用户的要求，也不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。 （4）用户同意保障和维护鸣鹿健康及其他用户的利益，由于用户登录网站内容违法、不真实、不正当、侵犯第三方合法权益，或用户违反本协议项下的任何条款而给鸣鹿健康或任何其他第三人造成损失，用户同意承担由此造成的损害赔偿责任。
                </p>
                <p> 19、法律 用户和鸣鹿健康一致同意，与本协议的成立、生效、履行及其他方面相关的一切争议以及与使用鸣鹿健康的服务或产品相关的一切争议，均提交被告所在地人民法院以诉讼方式解决；且胜诉方有权要求对方承担与诉讼相关的合理的交通、住宿费用。若有任何服务条款与法律相抵触，那这些条款将按尽可能接近的方法重新解析，而其它条款则保持对用户产生法律效力和影响。
                    用户同意，鸣鹿健康所自行维护运营或者委托第三方维护的服务器内的数据库、数据可以在诉讼中作为证据使用，用户不得以该等数据库、数据为电子形式而否定其法律效力。同时，用户放弃要求鸣鹿健康对该等数据库、数据的表现形式进行公证的要求。
                </p>
                <p> 20、青少年用户特别提示 青少年用户必须遵守全国青少年网络文明公约： 要善于网上学习，不浏览不良信息； 要诚实友好交流，不侮辱欺诈他人； 要增强自护意识，不随意约会网友； 要维护网络安全，不破坏网络秩序； 要有益身心健康，不沉溺虚拟时空。
                    21、其他 （1）鸣鹿健康将视向用户所提供服务内容和相应产品之特性，要求用户在注册鸣鹿健康提供的有关服务和相应产品时，遵守特定的条件和条款；如该等条件和条款与以上服务条款有任何不一致之处，则以该等条件和条款为准。
                    （2）本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。 （3）本服务协议执行过程中所产生的任何问题本网站和用户都将友好协商解决。


                </p>
            </div>
            <div class="bot">
                <mt-button type="primary" size="normal" v-on:click="popupTerms=false">已阅</mt-button>
            </div>
        </mt-popup>
    </div>
</template>
<script>
    function getQuery(name, url) {
        if (!url) url = window.location.href;
        name = name.replace(/[\[\]]/g, "\\$&");
        var regex = new RegExp("[?&]" + name + "(=([^&#]*)|&|#|$)"),
            results = regex.exec(url);
        if (!results) return null;
        if (!results[2]) return '';
        return decodeURIComponent(results[2].replace(/\+/g, " "));
    }
    function calculateBmi(weight, height) {
        if (weight > 0 && height > 0) {
            var finalBmi = weight / (height / 100 * height / 100)
            return finalBmi;
        }
        else {
            return 0;
        }
    }
    import { MessageBox } from 'mint-ui';
    import WxShare from '../libs/wx_share.js';
    export default {
        data() {
            return {
                weight: getQuery('w'),
                height: getQuery('h'),
                agree: false,
                popupTerms: false
            }
        },
        created() {

            var shareData = {
                "title": '鸣鹿健康',// 分享标题
                "desc": '鸣鹿健康，瘦身伙伴',// 分享描述
                "link": location.href, // 分享链接
                "img_url": 'https://a1.nicaifu.com/dora/201701/ed587c92d6f09f4_ojv93q.jpg',
            }


            var wxShare = new WxShare();
            wxShare.start(shareData);
        },
        computed: {
            bmi: function () {
                return calculateBmi(this.weight, this.height).toFixed(2);
            },
            perform: function () {
                let perform = '';
                let notice = '';
                if (this.bmi <= 18.5) {
                    perform = '偏瘦';
                    notice = '您目前的体重属于瘦弱，请加强营养，健康增重。';
                    this.left = 9;
                } else if (this.bmi <= 24) {
                    perform = '正常';
                    notice = '你的体重很标准，不需要刻意减肥。如果你想预防肥胖，可以参考我们推荐的健康饮食方案。良好的饮食习运动习惯有助于你保持身材，远离亚健康。';
                    this.left = 28;
                } else if (this.bmi <= 28) {
                    perform = '超重';
                    notice = '你的体重已经超标，规律和节制的饮食以及适量的运动会帮助你减肥成功，建议你立刻减肥。';
                    this.left = 47;
                } else {
                    perform = '肥胖';
                    notice = '你的体重属于肥胖，肥胖会加重你患上糖尿病、高血压等心血管疾病的风险，规律和节制的饮食以及适量的运动会帮助你减肥成功，建议你立刻减肥。';
                    this.left = 75;
                }
                this.notice = notice;
                return perform;
            }
        },
        methods: {
            start: function () {

                if (!this.agree) {
                    MessageBox('注意', '请同意协议');
                    return;
                } else {
                    let data = JSON.parse(getQuery('data'));
                    this.$http.post('/Info/infoadd', data).then(response => {
                        let data = response.body;
                        if (data.success) {
                            location.href = '/prefer/prefer';
                        } else {
                            MessageBox('注意', '请求失败');
                        }
                    }, response => {
                        MessageBox('注意', '抱歉，链接出现问题');
                    });
                }
            }
        }
    }

</script>
<style lang="scss">
    .next-btn {
        text-align: center;
    }

    .bmi-page {
        padding-bottom: 80px;
    }

    .terms {
        margin: 17px 0 40px 0;
        text-align: center;
        .text {
            color: blue;
        }
    }

    .buy-notice {
        margin-bottom: 50px;
        padding: 0 12px;
    }

    .description {
        font-size: 15px;
        padding: 18px 0;
        text-align: left;
        border-top: solid 1px #999;
        margin: 35px 10px 0 10px;
        color: #333;
    }

    body {
        background: #f7f7f7;
    }
    .bmi-container {
        overflow: hidden;
        margin: 15px 16px;
        background: #fff;
        .title {
            font-size: 15px;
            text-align: center;
            vertical-align: middle;
            padding-top: 25px;
            overflow: hidden;
            .number {
                font-size: 18px;
                color: #f2901e;
            }
            .text {
                font-size: 18px;
                color: #f2901e;
            }
        }
        .info {
            font-size: 15px;
            margin-top: 18px;
            text-align: center;
        }
        .line {
            margin-top: 14px;
            .bmi-line {
                text-align: center;
                img {
                    width: 80%;
                }
            }
            .line-arrow {
                height: 30px;
                position: relative;
                left: -10px;
                width: 80%;
                margin: auto;
                img {
                    width: 23px;
                    left: 100%;
                    position: absolute;
                }
            }
        }
    }
</style>
